export const anekdots = [
  `Єбуться два клоуна, один другому каже:<br />
  &#8212; Щось уже ніхуя не смішно.`,
  `Малинький єврейський хлопчик копаєся у пеплови. Підходить до него німецький солдат і питає: <br /> &#8212; Своїх шукаєш?`,
  `Сидять два гея у басейні. Тут з під води винирює сперма. Один гей питає іншого: <br />
  &#8212; Ти кончив? <br />
  &#8212; Ні, я пукнув.`,
  `Жив-був цар. І була в нього косоокість. Пішов він одного разу, куди очі дивляться і порвався.`,
  `Олег попал в жуткую аварию и чудом выжил. "Чудес не бывает", — подумал Олег и залез обратно в горящую машину.`,
  `В Африке, если человек на 80% состоит из воды, то считается, что он из благополучной семьи.`,
  `— Мама, смотри, негр тает! <br />
  — Сыночек, не тает, а какает`,
  `Клоун після сексу із презервативу зробив собачку.`,
  `Мітинг косооких відбувся на сорок метрів ліворуч від будівлі міської адміністрації.`,
  `Девушка не вовремя сделала каменное лицо и утонула.`,
  `Умер Гулливер… и лилипуты тихо сказали «Еб@ть копать…»`,
  `Что вы там делаете, уроды? — кричала бабушка уродам, которые что-то там делали.`,
  `Семечки из кармана больного, никак не давали хирургам приступить к операции.`,
  `Ніколи не потрібно сміятися із циганів на велосипеді. Це може бути ваш велосипед.`,
  `Толстые стриптизерши иногда перегибают палку.`,
  `Чтобы хоть как—то отвлечь внимание от дырки в носке, мальчик Петя ударил именинницу табуреткой.`,
  `Іде медвідь по хащи, видит горящу мшину, сів у неї і згорів.`,
  `Что сказал слепой, войдя в бар?<br />
  — Всем привет, кого не видел!`,
  `Почему в Африке так много болезней?<br />
  Потому что таблетки нужно запивать водой.`,
  `Что общего между хорошей шуткой и парнем с маленьким членом?<br />
  Конец смешной`,
  `Что сказал каннибал копрофилу?<br />
  — Ух ты, сегодня с подливой!`,
  `Что делает австрийский дрессировщик рептилий?<br />
  Гоняет крокодила по Вене`,
  `Знаете почему феминистки ненавидят геометрию?<br />
  Доказать ничего не могут`,
  `Как можно назвать Еврейский клуб в Германии?<br />
  "заходи на огонёк"`,
  `Что общего между педофилом и диабетиком?<br />
  Хочется Алёнку, но нельзя`,
  `Что говорит еврей-педофил после секса?<br />
  — Верни конфету`,
  `От чего умер еврей?<br />
  — Его клетки не хотели делиться!`,
  `Колобок завісився.`,
  `Идет лысый по пустыне, вдруг из—за угла его кто—то хватает за волосы и об асфальт.`,
  `Научился ежик попкой дышать, сел на пенек и задохнулся.`,
  `Русалка вирішила виступати у циркові і сіла на шпагат.`,
  `Мужик нашел подкову. <br />
  — Возьму, повешу у себя дома на счастье. <br />
  Поднимает, переворачивает на другую сторону, а там конь...`,
  `Идет ежик, вдруг встретилась ему река. Бросился он в реку, переплыл, вспомнил, что плавать не умеет, вернулся и утопился.`,
  `Упала вилка на підлогу, і почала валятися.`,
  `Едут два мужика в купейном вагоне. Один достает огромную сумку, вытаскивает из нее бананы, солит их и выкидывает в окно. Другой спрашивает: <br />
  — А зачем вы бананы солите и в окно выкидываете? <br />
  — Терпеть не могу соленые бананы!`,
  `Єбуться три клоуна, один другому каже: <br />
  — Щось уже ніхуя не смішно. <br />
  А третій отвічає: <br />
  — Чому, смішно же.`,
  `Змія зашпотилася і впала.`,
  `Штирлиц стрелял вслепую. Слепая испугалась и побежала скачками, но качки быстро отстали.`,
  `Штирлицу попала в голову пуля. "Разрывная," — раскинул мозгами Штирлиц.`,
  `Штирлиц всю ночь топил камин. На утро камин утонул.`,
  `Наївся Петька гороху з вечора, сидить, пердить цілу ніч. Батько не витримав і засунув Петькови шланг у дупу, а інший кінець у вікно вивів. Зрань батько прокидається, бачить Петька плаче і мучиться. <br />
  — Що сталося Петьку? <br />
  — Ох тату, зря я вчора гороху їв. До тепер хреново. А в ночі я взагалі так перданув, що кишка випала, мало не здох обратно засовуючи.`,
  `Знайшов Єврей кошельок, дивиться — а там не хватає.`,
  `Заходить негр із попугаєм на плечі у бар, підходить до бармена, а бармен питає: <br />
  — Де знайшов такого?<br />
  — У Африці — відповідає попугай.`,
  `Похоронил пацанчик друга своего, захотел с горя покурить, а сигарет нет. Приходит в табачный магазин, а ему с порога: <br />
  — Кента нет.`,
  `— Что это: жёлтое и не умеет плавать? <br />
  — Школьный автобус, полный детей.`,
  `Если бы моя бабушка знала, сколько денег я сэкономил на её похоронах, то она бы перевернулась в канаве.`,
  `Що таке із 4 ногами і 64 зубами? Крокодил. А що таке із 1 ногою і 6 зубами? Тоже крокодил.`,
  `— Знаете, что делают африканцы, чтобы не умереть от СПИДа? <br />
  — Что? <br />
  — Умирают от голода.`,
  `Один человек сильно привязался к люстре и умер.`,
  `Чтобы не перепутать, бабушка назвала одного новорожденного котенка Барсик, а второго утопила.`,
  `Учительница сказала, что тот, кто курит больше не вырастет. И в подтверждение своих слов застрелила семиклассника Петю.`,
  `Иду домой, смотрю — негр телевизор тащит. Я испугался, вдруг мой. Прибегаю домой — все в порядке. Мой траву косит.`,
  `— Мои знакомые говорят, что я расист. Но я люблю негров. И считаю, что у каждого должен быть свой негр…`
]